notes3a.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-17 Tue 21:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>FINA 3070 Notes 3A</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Ian Y.E. Pan" />
<link rel="stylesheet" type="text/css" href="imagine.css" />
</head>
<body>
<div id="content">
<h1 class="title">FINA 3070 Notes 3A</h1>
<div id="outline-container-org3b46b47" class="outline-2">
<h2 id="org3b46b47"><span class="section-number-2">1</span> Discount Rate: r</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgf31ec54" class="outline-3">
<h3 id="orgf31ec54"><span class="section-number-3">1.1</span> Use WACC</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>r = WACC (weighted average cost of capital), which in turn is calculated by \(E(r_{debt})\) and \(E(r_{equity})\).</li>
<li>Simple example: suppose firm's debt is 30% of firm's value at 7.5%
(lower risk) and equity is 70% of firm's value at 15%.
<ul class="org-ul">
<li>Company cost of capital = 7.5 &times; .3 + 15 &times; .7 = 12.75%</li>
</ul></li>
<li>\(E(r_{debt})\) is observable.</li>
<li>But \(E(r_{equity})\) (cost of equity) needs to be estimated &#x2013; the
hardest part of calculating WACC.</li>
</ul>
</div>
<div id="outline-container-orga1f6387" class="outline-4">
<h4 id="orga1f6387"><span class="section-number-4">1.1.1</span> The Company Cost of Capital</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>= Expected return of a portfolio of existing securities of that
company.</li>
<li>= the opportunity cost of capital for investment in the company's assets.</li>
<li>= the appropriate r for the company's average-risk projects.</li>
<li>Estimated as a "blend" of "cost of debt" (interest rate) and "cost
of equity" (expected rate of return demanded by investors in firm's
common stock).</li>
<li>If company has "no debt outstanding", then "company cost of capital"
= "expected rate of return on the company's stock".</li>
<li>E.g. suppose we know that a company's common stock has a beta of
value \(\beta\):
<ul class="org-ul">
<li>Company's \(r = r_f + \beta(r_m - r_f)\)</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgdaad597" class="outline-4">
<h4 id="orgdaad597"><span class="section-number-4">1.1.2</span> When Project's Risk \(\approx\) Equity-Market's Risk</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>Opportunity cost of capital.</li>
<li>Suppose \(E(r_m)\) is the current expected annual return of the equity market.</li>
<li>If a new project's risk is similar to the stock market's average equity
risk, then its "annual discount rate" should equal \(E(r_m)\).</li>
<li>We can estimate \(E(r_m)\) using the current \(r_f\) and historical
average of differences between \(r_m\) and \(r_f\), which is \((r_m-r_f)\).</li>
<li>I.e. \(E(r_m) = r_f + E(r_m-r_f)\)</li>
<li>\(r_f\) is the YTM of 1-year T-bill, will be in daily news.</li>
<li>\(E(r_m-r_f)\) is "market risk premium" (USA historically 7.7%).</li>
</ul>
</div>
</div>
<div id="outline-container-orgcc5f7b9" class="outline-4">
<h4 id="orgcc5f7b9"><span class="section-number-4">1.1.3</span> When project's risk \(\neq\) equity-market's risk</h4>
<div class="outline-text-4" id="text-1-1-3">
<ul class="org-ul">
<li>We need a model to calculate project's suitable discount rate.</li>
<li>E.g. CAPM (used by large firms and investors), APT, Fama-French 3-factor model.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orge2a4138" class="outline-2">
<h2 id="orge2a4138"><span class="section-number-2">2</span> CAPM: Capital Asset Pricing Model</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org0785d9b" class="outline-3">
<h3 id="org0785d9b"><span class="section-number-3">2.1</span> Overview</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Risk: diversifiable risk and non-diversifiable (systematic) risk.</li>
<li>The higher the systematic risk, the higher the required (expected)
return.</li>
<li>Even if a stock/project is very risk, if most of the risk is
diversifiable, then it doesn't need a high discount rate.</li>
</ul>
</div>
</div>
<div id="outline-container-orgdc752ed" class="outline-3">
<h3 id="orgdc752ed"><span class="section-number-3">2.2</span> Non-diversifiable risk: \(\beta\)</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Systematic risk is the sensitivity towards change in macro-economy.</li>
<li>The market portfolio is represented, in practice, by the S&amp;P 500.</li>
</ul>
</div>
<div id="outline-container-org5136d8f" class="outline-4">
<h4 id="org5136d8f"><span class="section-number-4">2.2.1</span> Understanding the scatter plots (Lec Ch7. p.13-15)</h4>
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li>The slope is the estimated beta.</li>
<li>\(R^2\) is the percentage of non-diversifiable risk in the total risk.
<ul class="org-ul">
<li>E.g. p.13 Right figure. \(R^2\) is 0.15, this means that 15% of the
total risk can be explained by market movement, while the rest 85%
was diversifiable.</li>
</ul></li>
<li>The values in parentheses (under beta) are the standard errors of
each estimation, representing the possible mismeasurement.</li>
</ul>
</div>
</div>
<div id="outline-container-org3667b62" class="outline-4">
<h4 id="org3667b62"><span class="section-number-4">2.2.2</span> Beta formula for an example stock \(i\)</h4>
<div class="outline-text-4" id="text-2-2-2">
<ul class="org-ul">
<li>\(\beta_i = \dfrac{\text{covariance of stock i's return with the
  market return}}{\text{variance of the market return}} = \dfrac{\sigma_{i,m}}{\sigma_m^2}\).</li>
</ul>
</div>
</div>
<div id="outline-container-org562ab64" class="outline-4">
<h4 id="org562ab64"><span class="section-number-4">2.2.3</span> Using regression to find beta</h4>
<div class="outline-text-4" id="text-2-2-3">
<ul class="org-ul">
<li>\(r_i (t) = \alpha + \beta_i r_m (t) + e_i (t)\)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org97289cb" class="outline-3">
<h3 id="org97289cb"><span class="section-number-3">2.3</span> <span class="todo TODO">TODO</span> SCL (Security Characteristic Lines) (pp.20)</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Systematic (non-diversifiable) risk: explained by the SCL.</li>
<li>Firm-specific (diversifiable) risk: unexplained by the SCL.</li>
<li>\(\sigma_i^2 = \beta_i^2 \cdot \sigma_m^2 + \sigma_{e_i}^2\)</li>
<li>Total risk = Systematic risk + Firm-specific (diversifiable) risk.</li>
<li>R-square = \(\dfrac{\text{systematic risk}}{\text{total risk}}\)</li>
</ul>
</div>
</div>
<div id="outline-container-orgea153f9" class="outline-3">
<h3 id="orgea153f9"><span class="section-number-3">2.4</span> <span class="todo TODO">TODO</span> ANOVA (pp.26-)</h3>
</div>
<div id="outline-container-orgb3d370d" class="outline-3">
<h3 id="orgb3d370d"><span class="section-number-3">2.5</span> <span class="todo TODO">TODO</span> More on beta and r (last 10 pages)</h3>
</div>
</div>
</div>
</body>
</html>
